r = float(input("Введите значение(>0) r:"))
x = float(input("Введите координату x(определён от минуст бесконечности до двух r):"))

if x < 0:
    y = (-0.5*x) - r
    print("Значение функции y равно {:.2f} ".format(y))
elif x >= 0 and x < r:
    y = -((r**2 - x**2)**(1/2))
    print("Значение функции y равно {:.2f} ".format(y))    
elif x >= r and x <= 2*r:
    y = (abs((r**2) - ((x-2*r)**2)))**(1/2)
    print("Значение функции y равно {:.2f} ".format(y))  
else:
    print("значение не определенно")